; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-38)
(:domain gripper-strips)
(:objects rooma roomb left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 )
(:init
(room rooma)
(room roomb)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
(at ball35 roomb)
(at ball36 roomb)
(at ball37 roomb)
(at ball38 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at ball35 rooma)
(at ball36 rooma)
(at ball37 rooma)
(at ball38 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 20 of 38
2. (pick ball38 roomb left)
   deleted: (at ball38 roomb) (free left)
   added: (carry ball38 left)
   goals met: 20 of 38
3. (pick ball37 roomb right)
   deleted: (at ball37 roomb) (free right)
   added: (carry ball37 right)
   goals met: 20 of 38
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 38
5. (drop ball37 rooma right)
   deleted: (carry ball37 right)
   added: (at ball37 rooma) (free right)
   goals met: 21 of 38
6. (drop ball38 rooma left)
   deleted: (carry ball38 left)
   added: (at ball38 rooma) (free left)
   goals met: 22 of 38
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 38
8. (pick ball36 roomb left)
   deleted: (at ball36 roomb) (free left)
   added: (carry ball36 left)
   goals met: 22 of 38
9. (pick ball35 roomb right)
   deleted: (at ball35 roomb) (free right)
   added: (carry ball35 right)
   goals met: 22 of 38
10. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 38
11. (drop ball35 rooma right)
   deleted: (carry ball35 right)
   added: (at ball35 rooma) (free right)
   goals met: 23 of 38
12. (drop ball36 rooma left)
   deleted: (carry ball36 left)
   added: (at ball36 rooma) (free left)
   goals met: 24 of 38
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 38
14. (pick ball34 roomb left)
   deleted: (at ball34 roomb) (free left)
   added: (carry ball34 left)
   goals met: 24 of 38
15. (pick ball33 roomb right)
   deleted: (at ball33 roomb) (free right)
   added: (carry ball33 right)
   goals met: 24 of 38
16. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 38
17. (drop ball33 rooma right)
   deleted: (carry ball33 right)
   added: (at ball33 rooma) (free right)
   goals met: 25 of 38
18. (drop ball34 rooma left)
   deleted: (carry ball34 left)
   added: (at ball34 rooma) (free left)
   goals met: 26 of 38
19. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 38
20. (pick ball32 roomb left)
   deleted: (at ball32 roomb) (free left)
   added: (carry ball32 left)
   goals met: 26 of 38
21. (pick ball31 roomb right)
   deleted: (at ball31 roomb) (free right)
   added: (carry ball31 right)
   goals met: 26 of 38
22. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 38
23. (drop ball31 rooma right)
   deleted: (carry ball31 right)
   added: (at ball31 rooma) (free right)
   goals met: 27 of 38
24. (drop ball32 rooma left)
   deleted: (carry ball32 left)
   added: (at ball32 rooma) (free left)
   goals met: 28 of 38
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 38
26. (pick ball30 roomb left)
   deleted: (at ball30 roomb) (free left)
   added: (carry ball30 left)
   goals met: 28 of 38
27. (pick ball29 roomb right)
   deleted: (at ball29 roomb) (free right)
   added: (carry ball29 right)
   goals met: 28 of 38
28. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 28 of 38
29. (drop ball29 rooma right)
   deleted: (carry ball29 right)
   added: (at ball29 rooma) (free right)
   goals met: 29 of 38
30. (drop ball30 rooma left)
   deleted: (carry ball30 left)
   added: (at ball30 rooma) (free left)
   goals met: 30 of 38
31. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 38
32. (pick ball28 roomb left)
   deleted: (at ball28 roomb) (free left)
   added: (carry ball28 left)
   goals met: 30 of 38
33. (pick ball27 roomb right)
   deleted: (at ball27 roomb) (free right)
   added: (carry ball27 right)
   goals met: 30 of 38
34. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 30 of 38
35. (drop ball27 rooma right)
   deleted: (carry ball27 right)
   added: (at ball27 rooma) (free right)
   goals met: 31 of 38
36. (drop ball28 rooma left)
   deleted: (carry ball28 left)
   added: (at ball28 rooma) (free left)
   goals met: 32 of 38
37. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 32 of 38
38. (pick ball26 roomb left)
   deleted: (at ball26 roomb) (free left)
   added: (carry ball26 left)
   goals met: 32 of 38
39. (pick ball25 roomb right)
   deleted: (at ball25 roomb) (free right)
   added: (carry ball25 right)
   goals met: 32 of 38
40. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 32 of 38
41. (drop ball25 rooma right)
   deleted: (carry ball25 right)
   added: (at ball25 rooma) (free right)
   goals met: 33 of 38
42. (drop ball26 rooma left)
   deleted: (carry ball26 left)
   added: (at ball26 rooma) (free left)
   goals met: 34 of 38
43. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 34 of 38
44. (pick ball24 roomb left)
   deleted: (at ball24 roomb) (free left)
   added: (carry ball24 left)
   goals met: 34 of 38
45. (pick ball23 roomb right)
   deleted: (at ball23 roomb) (free right)
   added: (carry ball23 right)
   goals met: 34 of 38
46. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 34 of 38
47. (drop ball23 rooma right)
   deleted: (carry ball23 right)
   added: (at ball23 rooma) (free right)
   goals met: 35 of 38
48. (drop ball24 rooma left)
   deleted: (carry ball24 left)
   added: (at ball24 rooma) (free left)
   goals met: 36 of 38
49. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 36 of 38
50. (pick ball22 roomb left)
   deleted: (at ball22 roomb) (free left)
   added: (carry ball22 left)
   goals met: 36 of 38
51. (pick ball21 roomb right)
   deleted: (at ball21 roomb) (free right)
   added: (carry ball21 right)
   goals met: 36 of 38
52. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 36 of 38
53. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 37 of 38
54. (drop ball21 rooma right)
   deleted: (carry ball21 right)
   added: (at ball21 rooma) (free right)
   goals met: 38 of 38
